In [1]:
import pandas as pd
import numpy as np

In [5]:
# Download the data file at https://gist.github.com/bobbae/b4eec5b5cb0263e7e3e63a6806d045f2 as "raw".
#read the file into a program memory.

df = pd.read_csv('Raw.csv')
df

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [6]:
#Once the data is read into memory in your program, print out how many rows of the data is in the CSV data. 
#This is your first printed answer.

df.info

<bound method DataFrame.info of        Year  Rank                Company  Revenue (in millions)  \
0      1955     1         General Motors                 9823.5
1      1955     2            Exxon Mobil                 5661.4
2      1955     3             U.S. Steel                 3250.4
3      1955     4       General Electric                 2959.1
4      1955     5                 Esmark                 2510.8
...     ...   ...                    ...                    ...
25495  2005   496        Wm. Wrigley Jr.                 3648.6
25496  2005   497         Peabody Energy                 3631.6
25497  2005   498  Wendy's International                 3630.4
25498  2005   499     Kindred Healthcare                 3616.6
25499  2005   500   Cincinnati Financial                 3614.0

      Profit (in millions)
0                      806
1                    584.8
2                    195.4
3                    212.6
4                     19.1
...                    ...
25495                  493
25496                175.4
25497                 57.8
25498                 70.6
25499                  584

[25500 rows x 5 columns]>

In [42]:
#For each row, there are columns. One of the columns is the "profit". 
#The data in this profit column are not always valid. Sometimes the data is non-numeric. 
#Remove all rows with 'profit' that is not numerical value. Then print out how many rows of data are left.
#after removing all the rows with invalid non-numeric profit column data. This is your second printed answer.

data2 = df[pd.to_numeric(df['Profit (in millions)'], errors ='coerce').notnull()] 
data2

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [47]:
#You can now convert the content your read into memory in your program in Part 1 into JSON format 
#Write it out to another file called data2.json which should only contain rows of data that have the valid numeric profit values.
#Each row in the Array should contain data columns like year, rank, company, revenue, and profit.

data2.to_json('data2.json')
df = pd.read_json('data2.json')
df

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806.0
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
...,...,...,...,...,...
25495,2005,496,Wm. Wrigley Jr.,3648.6,493.0
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584.0

In [79]:
#Order the data based on the profit value. Print the top 20 rows with the highest profit values. 
#This is your third printed answer.

data = df.sort_index(axis=0,ascending=False) 
data.head(20)

,Year,Rank,Company,Revenue (in millions)
Profit (in millions),,,,
25330.0,2005,2,Exxon Mobil,270772.0
22071.0,1999,2,Ford Motor,144416.0
21510.0,2004,2,Exxon Mobil,213199.0
17853.0,2004,8,Citigroup,94713.0
17720.0,2001,1,Exxon Mobil,210392.0
17046.0,2005,8,Citigroup,108276.0
16593.0,2005,5,General Electric,152363.0
15320.0,2002,2,Exxon Mobil,191581.0
15276.0,2003,6,Citigroup,100789.0
15002.0,2004,5,General Electric,134187.0
14143.0,2005,18,Bank of America Corp.,63324.0
14126.0,2002,7,Citigroup,112022.0
14118.0,2003,5,General Electric,131698.0
13684.0,2002,6,General Electric,125913.0
13519.0,2001,6,Citigroup,111826.0
13328.0,2005,6,ChevronTexaco,147967.0
12735.0,2001,5,General Electric,129853.0
11797.0,2001,10,Verizon Communications,64707.0
11460.0,2003,3,Exxon Mobil,182466.0
11361.0,2005,24,Pfizer,52921.0